#include "config.h"

//---------------------------------------------------------------------------------------------------------------//
//函数名称：I2C_Delay				
//函数功能: I2C需要的延时时间，根据EEPROM芯片手册确定最小延时时间
//入口参数: 
//出口参数: 
//说    明：
//---------------------------------------------------------------------------------------------------------------//
void I2C_Delay()
{
	NOP;NOP;NOP;NOP;NOP;
}

//---------------------------------------------------------------------------------------------------------------//
//函数名称：I2C_IOInit				
//函数功能: I2C总线初始化
//入口参数: 
//出口参数: 
//说    明：
//---------------------------------------------------------------------------------------------------------------//
void I2C_IOInit(void)
{
	I2C_SCL_H;
	I2C_SDA_H;
	I2C_SCL_OUT;
	I2C_SDA_OUT;
}

//---------------------------------------------------------------------------------------------------------------//
//函数名称：I2C_Start				
//函数功能: 发送I2C启动信号
//入口参数: 
//出口参数: 
//说    明：
//---------------------------------------------------------------------------------------------------------------//
void I2C_Start(void)
{
	I2C_SCL_H;
	I2C_SDA_H;
	I2C_SCL_OUT;
	I2C_SDA_OUT;

	I2C_Delay();
	I2C_SDA_L;
	I2C_Delay();
	I2C_SCL_L;
	I2C_Delay();
} 

//---------------------------------------------------------------------------------------------------------------//
//函数名称：I2C_Stop				
//函数功能: 发送I2C结束信号
//入口参数: 
//出口参数: 
//说    明：
//---------------------------------------------------------------------------------------------------------------//
void I2C_Stop(void)
{
	I2C_SCL_H;
	I2C_SDA_L;
	I2C_SCL_OUT;
	I2C_SDA_OUT;
	I2C_Delay();
	I2C_SDA_H;
	I2C_Delay();
}

//---------------------------------------------------------------------------------------------------------------//
//函数名称：I2C_SendByte				
//函数功能: 通过I2C发送一个字节
//入口参数: SdByte：要发送的字节
//出口参数: 返回应答结果，0--应答为0，否则应答为非0；
//说    明：返回值为整型数据，防止某个IO口放在高位导致没有接收到应答数据
//---------------------------------------------------------------------------------------------------------------//
uint8 I2C_SendByte(uint8 SdByte)
{
	uint8 temp;
	uint8 Ack;

	I2C_SCL_OUT;
	I2C_SDA_OUT;

	for(temp = 0; temp < 8; temp++)
	{
		I2C_SCL_L;
		I2C_Delay();
		if(SdByte & 0x80)
		{
			I2C_SDA_H;
		}
		else
		{
			I2C_SDA_L;
		}
		I2C_Delay();
		I2C_SCL_H;
		I2C_Delay();
		SdByte <<= 1;	
	}

	//ACK
	I2C_SCL_L;
	I2C_SDA_IN;
	I2C_Delay();
	I2C_SCL_H;
	I2C_Delay();
	Ack = I2C_SDA_IsH;
	I2C_Delay();
	I2C_SCL_L;
	return Ack;
}

//---------------------------------------------------------------------------------------------------------------//
//函数名称：I2C_RecvByte				
//函数功能: 通过I2C读取一个字节
//入口参数: ACK---指明接收函数是否发送应答，0--发送应答，否则不发送应答
//出口参数: 返回读取得到的字节
//说    明：
//---------------------------------------------------------------------------------------------------------------//
uint8 I2C_RecvByte(uint8 Ack)
{
	uint8 temp = 0;
	uint8 RecvByte = 0x00;

	I2C_SDA_IN;
	I2C_SCL_OUT;

	for(temp = 0; temp < 8; temp++)
	{
		I2C_SCL_L;
		I2C_Delay();
		I2C_SCL_H;
		I2C_Delay();
		RecvByte <<= 1;
		if(I2C_SDA_IsH)
		{
			RecvByte |=	0x01;
		}
		else
		{
			RecvByte &= 0xfe;
		}
		I2C_Delay();
	}

	I2C_SCL_L;
	I2C_Delay();
	I2C_SDA_OUT;
	if(Ack == 0)
	{
		I2C_SDA_L;
	}
	else
	{
		I2C_SDA_H;
	}

	I2C_Delay();
	I2C_SCL_H;
	I2C_Delay();
	I2C_SCL_L;

	return RecvByte;
}
